
&НаСервере
Процедура ЗагрузитьКурсыЗаПериодНаСервере()

	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ЗагрузитьКурсыВалютЗаПериод(Период.ДатаНачала,Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсыЗаПериод(Команда)
	
	ЗагрузитьКурсыЗаПериодНаСервере(); 
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсНаСегодняНаСервере()
	Обработка = РеквизитФормыВЗначение("Объект");
	Обработка.ПолучитьТекущиеКурсыВалют();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсНаСегодня(Команда)
	ЗагрузитьКурсНаСегодняНаСервере();
КонецПроцедуры
