
&НаСервере
Процедура ЗагрузитьОбновитьКурсВалютНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьКурсыВалютИзСайтаЦентроБанкаЕС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОбновитьКурсВалют(Команда)
	ЗагрузитьОбновитьКурсВалютНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсВалютЗа90ДнейНаСервере()

	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьДанныеПоВалютамЦентробанкаЗа90Дней();

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсВалютЗа90Дней(Команда)

	ЗагрузитьКурсВалютЗа90ДнейНаСервере();

КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКурсыВалютСОпределеннойДатыНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗагрузитьДанныеПоВалютамЦентробанкаЗаВесьПериод(ДатаНачала);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсыВалютСОпределеннойДаты(Команда)
	ЗагрузитьКурсыВалютСОпределеннойДатыНаСервере();
КонецПроцедуры
